{
  "date": 9,
  "writtenFrom": "Rome, Italy",
  "title": "About live coding streams on Twitch",
  "summary": "\"That's like... your opinion, man...\"",
  "isSingleBody": false,
  "body": [
    {
      "parts": [
        "Let me express a <b>very personal frustration I experience each time I’m browsing Twitch<b>, and I end up clicking on somebody’s stream in the “Software and game development” category.",
        "Most of the time, what happens is I try to understand what the streamer is doing at the moment, what he’s trying to accomplish, and then <b>give up with an extreme sense of boredom after five minutes<b>. 99% of the times, unless the streamer is starting the project at the moment I’m watching, or just chatting with the audience, I can’t really follow what he/she’s doing.",
        "Look, <b>software development is not something you can pick up watching somebody do it at any moment, like a drawing, and follow up from there<b>. To build something meaningful and complex (that’s to say, not the usual TODO app), we end up in rabbitholes so deep, us and only us can dig through all of it and emerge victorious. Having somebody watching while you navigate the nested complexity of a UI library just to understand “how on earth do I add a corner radius to this rectangle?!” is not fun, at all. Unless it’s pair programming, our job is really not something worth sharing. It’s one of the least followed categories on Twitch for a reason, after all.",
        "The only people I enjoyed watching a bit, where somebody explaining coding concepts, language or framework details, or following a tutorial I could follow myself. <b>Having to watch somebody dig through countless functions of his/her codebase, trying to fix an issue which usually takes about an hour, is just boring as hell<b>.",
        "I get it. You’re streaming because, while building your product, alone, at least you have somebody to talk with from time to time. In this case though, I’d advise making your stream a little funnier. <b>Stream only when you have to learn something new, exciting, not when it’s debugging time<b>. Also, your debugging will double in time, since getting distracted by the chat is a perfect way to break your focus."
      ]
    }
  ]
}