{
  "date": 9,
  "writtenFrom": "Rome, Italy",
  "title": "My favourite movies - Part 1: The Big Short",
  "summary": "What I liked about it and what you could enjoy",
  "isSingleBody": false,
  "body": [
    {
      "parts": [
        "Today, for no particular reason, I watched “The Big Short” again. It’s one of my favourite movies, one of those I don’t mind rewatching for the nth time, over and over.",
        "Actually, I now remember why I watched it. I’m watching <i>The Office<i> tv series, and Steve Carell made me remember he also appeared in that movie (although, not even close to the acting skills of <i>The Office<i>).",
        "There are some reasons why it’s one of my favourite movies.",
        "First, it’s about finance. I like exploring and studying that world (more about it in future posts… maybe!).",
        "Secondly, it’s a movie about the immense stupidity, blindness, and greed of human beings. It’s a movie about our faulty, irrational mind, our “sheep herd instinct” moving our decisions, not always in a good way. It’s a movie about a Black Swan, <a>as Taleb would call it|https://en.wikipedia.org/wiki/The_Black_Swan:_The_Impact_of_the_Highly_Improbable<a>. It shows how we are incapable of thinking rationally on our own and stop trusting the supposed “experts” out there when they’re so blatantly wrong about something.",
        "How can we call ourselves a rational race, a community of sentient beings, when such a financial crisis happened just in front of our eyes? How can it be that only a handful of people, most of them outcasts, understood what people with six-figure salaries plainly ignored?",
        "Can it really be stupidity only? Foolishness, blindness? Or are they all criminals?",
        "I guess it must be a mix of all of those, depending on each one of those involved. Most human beings just surf the wave they have under their feet, with or without awareness about what they're really doing, I guess.",
        "That’s what fascinates me. The technicalities are surely interesting, but understanding at a deep level the psychology of people involved in this massive “foolish scam”, is much more rewarding.",
        "",
        "P.S.: In Italian, <i>The Big Short<i> was translated as <i>La Grande Scommessa<i>, which means “The big bet”. Kind of misses the point, doesn’t it?"
      ]
    }
  ]
}